/**
 * 1/11 15min
 *
 * # 学到
 * 1. 跟循环有关的用 % 注意 0的时候直接返回
 * 2. splice concat组合估计很好用
 */
function solution(A, K) {
  const count = K % A.length
  if (count === 0) return A
  return A.splice(A.length - count).concat(A)
}

solution([3, 8, 9, 7, 6], 3) // [9, 7, 6, 3, 8]
solution([0, 0, 0], 1) // [0, 0, 0]
solution([1, 2, 3], 1) // [3, 1, 2]
solution([1, 2, 3, 4], 4) // [1, 2, 3, 4]
//N K = 0 ~ 100
//A[n-1] = -1000 ~ 1000
/**
 * [3, 8, 9, 7, 6] -> [6, 3, 8, 9, 7]
 * [6, 3, 8, 9, 7] -> [7, 6, 3, 8, 9]
 * [7, 6, 3, 8, 9] -> [9, 7, 6, 3, 8]
 * [9, 7, 6, 3, 8] -> [8, 9, 7, 6, 3]
 * [8, 9, 7, 6, 3] -> [3, 8, 9, 7, 6]
 **/